import sys
import os

# 将父目录添加到系统路径
sys.path.append(os.path.dirname(os.path.dirname(os.path.abspath(__file__))))

from fit_data_6.BPNN_predict import predict
import numpy as np

# 创建一个新的输入数据
# X_new = np.array([0.995341739, 0.786010426, -0.886444809, 0.182665509, 1.73261416, 1.087535277, -0.051123515, 0.407043123, 0.597274363, -0.618234349, -0.19764553, -0.25507233])
X_new = np.array(
    [
        -0.439911351, # (0.961356092,17.26555061340332)
        0.810837188, # 最大值: 21.66891098022461 在位置: [0.96344699 0.85319064]
        -1.05117746,
        0.289422608,
        1.277286447,
        0.74878728,
        0.00329239,
        0.210143669,
        0.92078762,
        -0.557522222,
        -0.320331774,
        -0.585318485,
    ]
)

Y_pred = predict(X_new)[45]
print("预测输出：", Y_pred)